; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s6-p16-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (at t0 l0-3)
    (at t1 l1-3)
    (at t2 l2-5)
    (at p0 l2-2)
    (at p1 l2-0)
    (at p2 l0-3)
    (at p3 l2-4)
    (at p4 l0-4)
    (at p5 l0-3)
    (at p6 l0-5)
    (at p7 l1-0)
    (at p8 l2-5)
    (at p9 l0-1)
    (at p10 l1-0)
    (at p11 l2-4)
    (at p12 l1-1)
    (at p13 l1-4)
    (at p14 l2-5)
    (at p15 l1-5)
    (at a0 l2-0)
    (at a1 l0-0)
)
(:goal
    (and
        (at p0 l1-0)
        (at p1 l0-5)
        (at p2 l1-3)
        (at p3 l2-5)
        (at p4 l1-2)
        (at p5 l0-2)
        (at p6 l2-5)
        (at p7 l1-1)
        (at p8 l1-2)
        (at p9 l0-3)
        (at p10 l0-4)
        (at p11 l2-4)
        (at p12 l2-3)
        (at p13 l0-2)
        (at p14 l2-2)
        (at p15 l2-2)
    )
)

  (:constraints
    (and
      (always (not (in p11 a0)))
      (always (not (in p11 a1)))
      (always (not (in p14 a0)))
      (always (not (in p14 a1)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p5 a0)))
      (always (not (in p5 a1)))
      (always (not (in p7 a0)))
      (always (not (in p7 a1)))
      (always (not (in p9 a0)))
      (always (not (in p9 a1)))
    )
  )
)

; plan
1. (load-airplane p1 a0 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a0)
   goals met: 1 of 16
2. (load-truck p8 t2 l2-5)
   deleted: (at p8 l2-5)
   added: (in p8 t2)
   goals met: 1 of 16
3. (load-truck p14 t2 l2-5)
   deleted: (at p14 l2-5)
   added: (in p14 t2)
   goals met: 1 of 16
4. (load-truck p5 t0 l0-3)
   deleted: (at p5 l0-3)
   added: (in p5 t0)
   goals met: 1 of 16
5. (load-truck p2 t0 l0-3)
   deleted: (at p2 l0-3)
   added: (in p2 t0)
   goals met: 1 of 16
6. (drive-truck t1 l1-3 l1-5 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-5)
   goals met: 1 of 16
7. (load-truck p15 t1 l1-5)
   deleted: (at p15 l1-5)
   added: (in p15 t1)
   goals met: 1 of 16
8. (drive-truck t2 l2-5 l2-4 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-4)
   goals met: 1 of 16
9. (drive-truck t0 l0-3 l0-5 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-5)
   goals met: 1 of 16
10. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 1 of 16
11. (load-truck p3 t2 l2-4)
   deleted: (at p3 l2-4)
   added: (in p3 t2)
   goals met: 1 of 16
12. (load-truck p6 t0 l0-5)
   deleted: (at p6 l0-5)
   added: (in p6 t0)
   goals met: 1 of 16
13. (load-truck p13 t1 l1-4)
   deleted: (at p13 l1-4)
   added: (in p13 t1)
   goals met: 1 of 16
14. (drive-truck t2 l2-4 l2-3 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-3)
   goals met: 1 of 16
15. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 1 of 16
16. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 1 of 16
17. (load-truck p4 t0 l0-4)
   deleted: (at p4 l0-4)
   added: (in p4 t0)
   goals met: 1 of 16
18. (drive-truck t2 l2-3 l2-2 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-2)
   goals met: 1 of 16
19. (unload-truck p14 t2 l2-2)
   deleted: (in p14 t2)
   added: (at p14 l2-2)
   goals met: 2 of 16
20. (load-truck p0 t2 l2-2)
   deleted: (at p0 l2-2)
   added: (in p0 t2)
   goals met: 2 of 16
21. (drive-truck t0 l0-4 l0-2 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-2)
   goals met: 2 of 16
22. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 2 of 16
23. (unload-truck p5 t0 l0-2)
   deleted: (in p5 t0)
   added: (at p5 l0-2)
   goals met: 3 of 16
24. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 3 of 16
25. (load-truck p12 t1 l1-1)
   deleted: (at p12 l1-1)
   added: (in p12 t1)
   goals met: 3 of 16
26. (unload-truck p8 t2 l2-0)
   deleted: (in p8 t2)
   added: (at p8 l2-0)
   goals met: 3 of 16
27. (unload-truck p0 t2 l2-0)
   deleted: (in p0 t2)
   added: (at p0 l2-0)
   goals met: 3 of 16
28. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 3 of 16
29. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 3 of 16
30. (load-airplane p8 a0 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a0)
   goals met: 3 of 16
31. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 3 of 16
32. (unload-truck p15 t1 l1-0)
   deleted: (in p15 t1)
   added: (at p15 l1-0)
   goals met: 3 of 16
33. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 3 of 16
34. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 3 of 16
35. (load-truck p7 t1 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 t1)
   goals met: 3 of 16
36. (load-truck p9 t0 l0-1)
   deleted: (at p9 l0-1)
   added: (in p9 t0)
   goals met: 3 of 16
37. (drive-truck t2 l2-0 l2-5 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-5)
   goals met: 3 of 16
38. (drive-truck t0 l0-1 l0-5 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-5)
   goals met: 3 of 16
39. (unload-truck p3 t2 l2-5)
   deleted: (in p3 t2)
   added: (at p3 l2-5)
   goals met: 4 of 16
40. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 4 of 16
41. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 4 of 16
42. (drive-truck t0 l0-5 l0-0 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-0)
   goals met: 4 of 16
43. (drive-truck t2 l2-5 l2-0 c2)
   deleted: (at t2 l2-5)
   added: (at t2 l2-0)
   goals met: 4 of 16
44. (unload-truck p7 t1 l1-1)
   deleted: (in p7 t1)
   added: (at p7 l1-1)
   goals met: 5 of 16
45. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 5 of 16
46. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 5 of 16
47. (unload-truck p6 t0 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 5 of 16
48. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 5 of 16
49. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 5 of 16
50. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 5 of 16
51. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 5 of 16
52. (unload-airplane p8 a0 l1-0)
   deleted: (in p8 a0)
   added: (at p8 l1-0)
   goals met: 5 of 16
53. (unload-airplane p0 a0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 6 of 16
54. (load-airplane p6 a1 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a1)
   goals met: 6 of 16
55. (load-airplane p4 a1 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a1)
   goals met: 6 of 16
56. (load-airplane p2 a1 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a1)
   goals met: 6 of 16
57. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 6 of 16
58. (load-airplane p15 a0 l1-0)
   deleted: (at p15 l1-0)
   added: (in p15 a0)
   goals met: 6 of 16
59. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 6 of 16
60. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 6 of 16
61. (load-airplane p10 a0 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 a0)
   goals met: 6 of 16
62. (unload-truck p9 t0 l0-3)
   deleted: (in p9 t0)
   added: (at p9 l0-3)
   goals met: 7 of 16
63. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 7 of 16
64. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 7 of 16
65. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 7 of 16
66. (drive-truck t0 l0-3 l0-5 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-5)
   goals met: 7 of 16
67. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 7 of 16
68. (unload-airplane p6 a1 l2-0)
   deleted: (in p6 a1)
   added: (at p6 l2-0)
   goals met: 7 of 16
69. (unload-airplane p13 a0 l0-0)
   deleted: (in p13 a0)
   added: (at p13 l0-0)
   goals met: 7 of 16
70. (unload-airplane p10 a0 l0-0)
   deleted: (in p10 a0)
   added: (at p10 l0-0)
   goals met: 7 of 16
71. (unload-truck p8 t1 l1-2)
   deleted: (in p8 t1)
   added: (at p8 l1-2)
   goals met: 8 of 16
72. (drive-truck t0 l0-5 l0-0 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-0)
   goals met: 8 of 16
73. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 8 of 16
74. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 8 of 16
75. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 8 of 16
76. (unload-airplane p15 a0 l2-0)
   deleted: (in p15 a0)
   added: (at p15 l2-0)
   goals met: 8 of 16
77. (unload-airplane p12 a0 l2-0)
   deleted: (in p12 a0)
   added: (at p12 l2-0)
   goals met: 8 of 16
78. (unload-airplane p4 a1 l1-0)
   deleted: (in p4 a1)
   added: (at p4 l1-0)
   goals met: 8 of 16
79. (unload-airplane p2 a1 l1-0)
   deleted: (in p2 a1)
   added: (at p2 l1-0)
   goals met: 8 of 16
80. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 8 of 16
81. (load-truck p6 t2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 t2)
   goals met: 8 of 16
82. (drive-truck t0 l0-0 l0-5 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-5)
   goals met: 8 of 16
83. (load-truck p15 t2 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 t2)
   goals met: 8 of 16
84. (load-truck p12 t2 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 t2)
   goals met: 8 of 16
85. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 8 of 16
86. (load-truck p2 t1 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 8 of 16
87. (unload-truck p1 t0 l0-5)
   deleted: (in p1 t0)
   added: (at p1 l0-5)
   goals met: 9 of 16
88. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 9 of 16
89. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 9 of 16
90. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 9 of 16
91. (unload-truck p12 t2 l2-3)
   deleted: (in p12 t2)
   added: (at p12 l2-3)
   goals met: 10 of 16
92. (unload-truck p4 t1 l1-2)
   deleted: (in p4 t1)
   added: (at p4 l1-2)
   goals met: 11 of 16
93. (drive-truck t2 l2-3 l2-2 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-2)
   goals met: 11 of 16
94. (drive-truck t1 l1-2 l1-3 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-3)
   goals met: 11 of 16
95. (drive-truck t0 l0-4 l0-0 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-0)
   goals met: 11 of 16
96. (unload-truck p15 t2 l2-2)
   deleted: (in p15 t2)
   added: (at p15 l2-2)
   goals met: 12 of 16
97. (unload-truck p2 t1 l1-3)
   deleted: (in p2 t1)
   added: (at p2 l1-3)
   goals met: 13 of 16
98. (load-truck p13 t0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 t0)
   goals met: 13 of 16
99. (load-truck p10 t0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 t0)
   goals met: 13 of 16
100. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 13 of 16
101. (drive-truck t2 l2-2 l2-5 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-5)
   goals met: 13 of 16
102. (unload-truck p6 t2 l2-5)
   deleted: (in p6 t2)
   added: (at p6 l2-5)
   goals met: 14 of 16
103. (unload-truck p10 t0 l0-4)
   deleted: (in p10 t0)
   added: (at p10 l0-4)
   goals met: 15 of 16
104. (drive-truck t0 l0-4 l0-2 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-2)
   goals met: 15 of 16
105. (unload-truck p13 t0 l0-2)
   deleted: (in p13 t0)
   added: (at p13 l0-2)
   goals met: 16 of 16
